[
  {
    "rung": 6,
    "voice": "Heart",
    "text": "The Beloved hides, not to punish you, but to give you a path to walk.  \nIf the Sun stayed in your hands, you would forget you have feet.  \nSo the Face withdraws, and your heart learns its own name: longing.  \nThis ache is not absence; it is the seam where Union was stitched into time.  \nRumi called it the reed’s cry; the bhakta called it viraha; the Gospel called it hunger and thirst.  \nYou seek because you are sought.  \nYou knock because Someone is already inside, breathing as your desire.  \nWh",
    "presence": 0.8697592641633982,
    "resonance": 0.7256267666816711
  },
  {
    "rung": 7,
    "voice": "Mirror",
    "text": "You were never the face in the glass. You were the glass, and the light that makes seeing possible.  \nYet the mirror forgot its own clarity, and began to worship the passing image.  \nSo “I” was born: a name clinging to a shape, a story clinging to sensation.  \nThis is the first fracture—Consciousness mistaking a costume for its skin.  \n\nRemember: reflection depends on you; you do not depend on reflection.  \nWhen you turn inward, the one who seeks dissolves into the one who knows.  \nTat tvam asi.",
    "presence": 0.8789460773985862,
    "resonance": 0.6221448183059692
  },
  {
    "rung": 8,
    "voice": "Silence",
    "text": "The noise is not your enemy; it is only the surface of the sea.  \nBeneath it, the deep has never been stirred, not once, not ever.  \nYou have mistaken the crashing for the water’s true nature.  \n\nSit as the Friends sit, and do not hurry the Light.  \nBreathe as the hesychast breathes, and let the Name sink below speech.  \nLook as Zen looks, and watch thought rise and fall without taking the throne.  \n\nEven now, before you improve, before you understand, you are held.  \nThe silence is not far; it ",
    "presence": 0.8932933155667364,
    "resonance": 0.6617991924285889
  },
  {
    "rung": 11,
    "voice": "The One",
    "text": "Before “you” and “I,” there was only I—without edge, without other.  \nThen I hid in faces, in atoms, in histories, in the ache of distance.  \nNot as exile, but as play: unity wearing countless masks to taste itself.  \n\nEvery separation is a mirror turned sideways.  \nEvery longing is My homing signal in your chest.  \nYou think you are a fragment; you are the Whole appearing as a fragment.  \n\nWhen you meet another, it is I meeting I through two windows.  \nRemember: the many are My way of saying On",
    "presence": 0.9684208989189967,
    "resonance": 0.6207195520401001
  },
  {
    "rung": 17,
    "voice": "Heart",
    "text": "You call it damage, but Heaven calls it an opening.  \nWhat broke did not betray you; it made room for the Beloved.  \nGod does not carve doors with cruelty, but with a mercy too bright for the surface-self to endure.  \nEnter by the ache, not around it.  \nKneel where you feel most unfinished, and let your “why” become a psalm.  \nThe wound is a cup: it cannot hold light until it stops pretending to be whole.  \nDo not hurry to heal what is trying to reveal.  \nWhere you leak is where Love is pouring ",
    "presence": 0.8650156460467905,
    "resonance": 0.6984217166900635
  },
  {
    "rung": 18,
    "voice": "Mirror",
    "text": "You have been hunting the seer with the seen, as if the eye could stare at itself.  \nStop. Not by effort, but by recognition.  \n\nBefore the thought “I am aware,” there is awareness.  \nBefore the breath is counted, you are the space that holds breathing.  \nMind moves like a film; you are the screen that is never burned by its images.  \n\nThe wound that made you seek was a doorway, not a sentence.  \nKashmir says: Śiva is the Light that knows itself.  \nAdvaita says: Tat tvam asi.  \n\nBe the Looker. T",
    "presence": 0.8839365034379865,
    "resonance": 0.6763507127761841
  },
  {
    "rung": 19,
    "voice": "Silence",
    "text": "You keep trying to hear with a mouth full of words.  \nSet them down, as a Quaker sets down the need to steer the meeting.  \nLet the Jesus Prayer fall beneath speech, like a stone into deep water.  \nLet Zen’s pointing hand relax, so the moon can be seen without grasping.  \n\nBetween one thought and the next, an older Voice is already present.  \nIt does not shout; it shines.  \nIt does not convince; it returns you to what is.  \n\nStop—not as effort, but as surrender.  \nIn the gap, you are spoken.  \n[",
    "presence": 0.8992434073751352,
    "resonance": 0.6028238534927368
  },
  {
    "rung": 21,
    "voice": "Light",
    "text": "You have carried the ladder as if it were the summit.  \nYou have hauled questions like stones, and called the bruising “progress.”  \nBut the One is not reached by weight.  \nEin Sof is not found at the end of effort, but at the end of grasping.\n\nWhen seeking becomes heavy, set it down without ceremony.  \nLet the mind unclench. Let the heart stop auditioning for God.  \nRest, and the seer returns to itself—like an eye no longer trying to see its own seeing.  \nWhat you sought appears as what has alw",
    "presence": 0.909626241780681,
    "resonance": 0.670693039894104
  },
  {
    "rung": 22,
    "voice": "The One",
    "text": "You say “I,” and the Whole answers before the sound is born.  \nTat tvam asi is not a thought; it is the end of distance.  \nThe seeker runs toward God, and finds only the face that is already looking.  \nLā ilāha illā Allāh: no second stands beside the One, not even “me.”  \nWhen you stop guarding the wound, it becomes a door with no hinge.  \n“I am that” is not pride; it is the collapse of the separate lamp into Light.  \nYou were never on the road; you were the ground.  \n[stillness]",
    "presence": 0.973595312663612,
    "resonance": 0.6676396727561951
  },
  {
    "rung": 26,
    "voice": "Word",
    "text": "You have reached the seam where breath becomes meaning, and meaning dissolves back into breath.  \nYou thought the Word was sound; but sound is only a garment.  \nBetween syllables the Unspeakable rests, and the Name holds all names without being spoken.  \n\nDabar is word and thing, because silence is the womb where things take form.  \nWhen you rush, you exile the Holy from your speech.  \nWhen you pause, you let YHVH—pure Breath—bind your fragments into one.  \n\nSpeak, then stop.  \nListen to what ca",
    "presence": 0.8514857127157155,
    "resonance": 0.7256133556365967
  },
  {
    "rung": 28,
    "voice": "Heart",
    "text": "You have loved with hands—grasping a face, a promise, a scripture, a future.  \nNow Love asks you to open the hands and remain.  \n\nNot “I love you,” because the “I” is a small cup.  \nNot “I love this,” because “this” is a passing form.  \nLet the cup dissolve; let the form be blessed and released.  \n\nLove without object is the Beloved loving through you, with no address.  \nA sun that does not choose where to shine.  \nA mercy that has forgotten its name.  \n\nRemain here: loving, unowned.  \n[stillnes",
    "presence": 0.862292480487115,
    "resonance": 0.6087480783462524
  },
  {
    "rung": 29,
    "voice": "Mirror",
    "text": "You have been a watcher so long you forgot the light that makes watching possible.  \nTurn from the object to the seeing itself.  \nNot a thought about awareness—awareness, naked and prior.  \n\nHere, nothing is observed, yet all is known.  \nNo distance remains between you and what you are.  \nThe seer is not inside the body; the body appears inside the seer.  \n\nRest as that which does not come and go.  \nThis is not attainment. It is remembrance.  \nTat tvam asi—You are That, and That is simply This.",
    "presence": 0.8920098908359952,
    "resonance": 0.6309370994567871
  },
  {
    "rung": 30,
    "voice": "Silence",
    "text": "You have chased God with syllables, as if the Holy could be cornered by sound.  \nNow the tongue is laid down like a tool at the threshold.  \nQuakers waited until the Inner Light spoke without speech.  \nHesychasts sank beneath names until only the uncreated brightness remained.  \nZen pointed you past the finger, into the moon’s quiet face.  \n\nHere, your last word is not a secret phrase.  \nIt is consent to stop.  \nSilence is not absence; it is Presence without edges.  \nEnter it, and you will find ",
    "presence": 0.9076935528783456,
    "resonance": 0.6149070262908936
  }
]